for i in range(3):  # Loop 3 times
    try:
        ዓመተ_ምሕረት = int(input("ዝደለይዎ ዓመተ-ምህረት የእትው: "))
        if ዓመተ_ምሕረት < 1:
            print("NB: ዓመተ_ምሕረት ልዕሊ ዜሮ ክከውን ኣለዎ!\n")
        else:
            ወርሒ = {
                1: 'መስከረም',
                2: 'ጥቅምቲ',
                3: 'ህዳር',
                4: 'ታሕሳስ',
                5: 'ጥሪ',
                6: 'የካቲት',
                7: 'መጋቢት',
                8: 'ሚይዝያ',
                9: 'ግንቦት',
                10: 'ሰነ',
                11: 'ሓምለ',
                12: 'ነሓሰ'
            }

            ዓመት_ዓለም = ዓመተ_ምሕረት + 5500
            መጠነ_ራብኢት = ዓመት_ዓለም // 4
            ወንጌል = {1: 'ማቲዎስ', 2: 'ማርቆስ', 3: 'ሉቋስ', 0: 'ዮሓንስ'}
            zemen = ዓመት_ዓለም % 4
            print(f"ዘመነ: {ወንጌል[zemen]} እዩ ።")

            ዘመን_መቀየሪ = {
                0: 'ሰኑይ', 1: 'ሰሉስ', 2: 'ረቡዕ',
                3: 'ሓሙስ', 4: 'ዓርቢ', 5: 'ቀዳም', 6: 'ሰንበት'
            }
            ጥንተ_ቀመር = (ዓመት_ዓለም + መጠነ_ራብኢት) % 7
            print(f"ባሕቲ መስከረም： {ዘመን_መቀየሪ[ጥንተ_ቀመር]} ይውዕል ።")

            መደብ = (ዓመት_ዓለም % 19)
            print("መደብ:", መደብ)

            ወንበር = መደብ - 1
            if መደብ == 0:
                ወንበር = 18
            print("ወንበር:", ወንበር)

            ኣበቅቴ = ወንበር * 11
            if ኣበቅቴ > 30:
                print("ኣበቅቴ:", ኣበቅቴ % 30)
            else:
                print("ኣበቅቴ:", ኣበቅቴ)

            መዓልቲ = {1: 'ሰንበት', 2: 'ሰኑይ', 3: 'ሰሉስ', 4: 'ረቡዕ', 5: 'ሓሙስ', 6: 'ዓርቢ', 0: 'ቀዳም'}
            ጥንተኦን = ጥንተ_ቀመር - 1

            if ጥንተኦን == 0:
                day = 6
            elif ጥንተኦን == 1:
                day = 7

            መጥቅእ = (ወንበር * 19) % 30
            if ወንበር == 0 or ኣበቅቴ == 0 or መጥቅእ == 0:
                መጥቅእ = 30

            if መጥቅእ < 14:
                day = ((2 + ጥንተኦን + መጥቅእ + 2) % 7)
                print(f"መጥቅእ: {ወርሒ[2]}, {መጥቅእ}, {መዓልቲ[day]}")
            if መጥቅእ > 14:
                day = ((ጥንተኦን + መጥቅእ + 2) % 7)
                print(f"መጥቅእ: {ወርሒ[1]}, {መጥቅእ}, {መዓልቲ[day]}")

            xy = መዓልቲ[day]
            ተውሳከ_ዕለት = {'ቀዳም': 8, 'ሰንበት': 7, 'ሰኑይ': 6, 'ሰሉስ': 5, 'ረቡዕ': 4, 'ሓሙስ': 3, 'ዓርቢ': 2}
            መበጃ_ሓመር = (መጥቅእ + ተውሳከ_ዕለት[xy]) % 30
            a = መጥቅእ + ተውሳከ_ዕለት[xy]

            if መጥቅእ == 0 or መጥቅእ == 1:
                መጥቅእ = 30
            if መበጃ_ሓመር == 0:
                መበጃ_ሓመር = 30
            print(f"መበጃ_ሓመር: {መበጃ_ሓመር}")

            ነነዌ = መበጃ_ሓመር
            if መጥቅእ < 14 or መጥቅእ == 30 or a > 30:
                day = ((10 + ጥንተኦን + ነነዌ + 2) % 7)
                print(f"ነነዌ: {ወርሒ[6]}, {ነነዌ}, {መዓልቲ[day]}")
            else:
                day = ((8 + ጥንተኦን + ነነዌ + 2) % 7)
                print(f"ነነዌ: {ወርሒ[5]}, {ነነዌ}, {መዓልቲ[day]}")

            ዓብይ_ጾም = (14 + መበጃ_ሓመር) % 30
            if ዓብይ_ጾም == 0:
                ዓብይ_ጾም = 30

            if መጥቅእ < 14 and መበጃ_ሓመር >= 17:
                month = 7
                day = ((2 * (month - 1) + ጥንተኦን + ዓብይ_ጾም + 2) % 7)
                print(f"ዓብይ_ጾም: {ወርሒ[month]}, {ዓብይ_ጾም}, {መዓልቲ[day]} ይጅምር።")
            else:
                month = 6
                day = ((2 * (month - 1) + ጥንተኦን + ዓብይ_ጾም + 2) % 7)
                print(f"ዓብይ_ጾም: {ወርሒ[month]}, {ዓብይ_ጾም}, {መዓልቲ[day]} ይጅምር።")

            ደብረ_ዘይት = (መበጃ_ሓመር + 11) % 30
            if ደብረ_ዘይት == 0:
                ደብረ_ዘይት = 30

            if ወርሒ[month] == 'የካቲት' and ዓብይ_ጾም <= 3:
                day = ((10 + ጥንተኦን + ደብረ_ዘይት + 2) % 7)
                print(f"ደብረ_ዘይት: {ወርሒ[6]}, {ደብረ_ዘይት}, {መዓልቲ[day]} ይውዕል")
            elif ወርሒ[month] == 'መጋቢት' and (ዓብይ_ጾም == 4 or ዓብይ_ጾም == 5):
                day = ((14 + ጥንተኦን + ደብረ_ዘይት + 2) % 7)
                print(f"ደብረ_ዘይት: {ወርሒ[8]}, {ደብረ_ዘይት}, {መዓልቲ[day]} ይውዕል")
            else:
                day = ((12 + ጥንተኦን + ደብረ_ዘይት + 2) % 7)
                print(f"ደብረ_ዘይት: {ወርሒ[7]}, {ደብረ_ዘይት}, {መዓልቲ[day]} ይውዕል")

            ሆሳዔና = (መበጃ_ሓመር + 2) % 30
            if ሆሳዔና == 0:
                ሆሳዔና = 30

            if ወርሒ[month] == 'የካቲት' and ዓብይ_ጾም <= 12:
                day = ((12 + ጥንተኦን + ሆሳዔና + 2) % 7)
                print(f"ሆሳዔና: {ወርሒ[7]}, {ሆሳዔና}, {መዓልቲ[day]} ይውዕል")
            else:
                day = ((14 + ጥንተኦን + ሆሳዔና + 2) % 7)
                print(f"ሆሳዔና: {ወርሒ[8]}, {ሆሳዔና}, {መዓልቲ[day]} ይውዕል")

            ስቅለት = (መበጃ_ሓመር + 7) % 30
            if ስቅለት == 0:
                ስቅለት = 30

            if ወርሒ[month] == 'የካቲት' and ዓብይ_ጾም <= 7:
                day = ((12 + ጥንተኦን + ስቅለት + 2) % 7)
                print(f"ስቅለት: {ወርሒ[7]}, {ስቅለት}, {መዓልቲ[day]} ይውዕል")
            else:
                day = ((14 + ጥንተኦን + ስቅለት + 2) % 7)
                print(f"ስቅለት: {ወርሒ[8]}, {ስቅለት}, {መዓልቲ[day]} ይውዕል")

            ትንሳኤ = (መበጃ_ሓመር + 9) % 30
            if ትንሳኤ == 0:
                ትንሳኤ = 30

            if ወርሒ[month] == 'የካቲት' and ዓብይ_ጾም <= 5:
                day = ((12 + ጥንተኦን + ትንሳኤ + 2) % 7)
                print(f"ትንሳኤ: {ወርሒ[7]}, {ትንሳኤ}, {መዓልቲ[day]} ይውዕል")
            else:
                day = ((14 + ጥንተኦን + ትንሳኤ + 2) % 7)
                print(f"ትንሳኤ: {ወርሒ[8]}, {ትንሳኤ}, {መዓልቲ[day]} ይውዕል")

            ጾመ_ሐዋርያት = (መበጃ_ሓመር + 29) % 30
            if ጾመ_ሐዋርያት == 0:
                ጾመ_ሐዋርያት = 30

            if ወርሒ[month] == 'የካቲት' and ዓብይ_ጾም <= 15:
                day = ((16 + ጥንተኦን + ጾመ_ሐዋርያት + 2) % 7)
                print(f"ጾመ_ሐዋርያት: {ወርሒ[9]}, {ጾመ_ሐዋርያት}, {መዓልቲ[day]} ይጅምር")
            else:
                day = ((18 + ጥንተኦን + ጾመ_ሐዋርያት + 2) % 7)
                print(f"ጾመ_ሐዋርያት: {ወርሒ[10]}, {ጾመ_ሐዋርያት}, {መዓልቲ[day]} ይጅምር")

    except ValueError:
        print("NB: ዓመተ-ምህረት ብቁፅሪ የእትው!\n")
    except ZeroDivisionError:
        print("NB: ንዜሮ ምምቃል ኣይከኣልን!")

    print(f" ========={i + 1}========= ")
